Revit 2027 API
SchemaCommon.Thumbnail Property
 The property labeled "Thumbnail" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Thumbnail { get; }
Public Shared ReadOnly Property Thumbnail As String
	Get
public:
static property String^ Thumbnail {
	String^ get ();
}
static member Thumbnail : string with get
Property Value
String
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyString".
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace